Revit 2026 API

# EaveCutterType Enumeration

---

An enumerated type to store type of EaveCutter.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum EaveCutterType
```
```vb
Public Enumeration EaveCutterType
```
```cpp
public enum class EaveCutterType
```
```fsharp
type EaveCutterType
```

| Member name | Value | Description |
| --- | --- | --- |
| PlumbCut | 33,615 | Plumb Cut type of Eave. |
| TwoCutPlumb | 33,619 | Two Cut Plumb type of Eave. |
| TwoCutSquare | 33,618 | Two Cut Square type of Eave. |

#### Reference

Autodesk.Revit.DB Namespace